tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Statistics utility to count lines of code
brew "cloc"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Drop-in replacement for MySQL
brew "mariadb"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node", link: false
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Hunt down social media accounts by username
brew "sherlock"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# UI for creating Windows installer ISO from UUPDump
cask "crystalfetch"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Cloud backup tool
cask "duplicacy-cli"
# Cloud backup tool
cask "duplicacy-web-edition"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-monocraft"
cask "font-sf-mono"
# Web browser
cask "google-chrome"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Sandbox construction video game
cask "minecraft"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Messaging app with a focus on speed and security
cask "telegram"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Connect to Windows
cask "windows-app"
vscode "alexandernanberg.horizon-theme-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "tamasfe.even-better-toml"
vscode "techtheawesome.rust-yew"
vscode "tomoki1207.pdf"
vscode "wayou.vscode-todo-highlight"
vscode "xabikos.javascriptsnippets"
vscode "zainchen.json"
